#+TITLE: Implement algorithms in Modern Fortran.
#+AUTHOR: Yuma Osada
#+DATE: {{{time(%Y-%m-%d)}}}.
#+LaTeX_header: \usepackage{minted}
#+LaTeX_header: \usepackage{cleveref}
#+macro: src_line line [[($1)]]
#+options: ^:{}
#+options: toc:t H:4 num:4
*** test
#+begin_src fortran :exports both :results output :cache yes
  module polymorphic_class_m
    use, intrinsic :: iso_fortran_env
    implicit none
    ! interface operator(.as.)
    !    module procedure :: class_to_int32
    !    module procedure :: class_to_real32
    ! end interface operator(.as.)

  contains
    pure integer(int32) function class_to_int32(v)
      class(*), intent(in) :: v
      select type(v)
      type is(integer(int32))
         class_to_int32 = v
      class default
         error stop 2
      end select
    end function class_to_int32

    pure integer(int32) function class_to_int32_dash(v, n)
      class(*), intent(in) :: v
      integer(int32), intent(in) :: n
      select type(v)
      type is(integer(int32))
         class_to_int32_dash = v
      class default
         error stop 2
      end select
    end function class_to_int32_dash
    pure real(real32) function class_to_real32(v, x)
      class(*), intent(in) :: v
      real(real32), intent(in) :: x
      select type(v)
      type is(real(real32))
         class_to_real32 = v
      class default
         error stop 3
      end select
    end function class_to_real32
  end module polymorphic_class_m

  program test_polymorphic_class
    use, intrinsic :: iso_fortran_env
    use polymorphic_class_m
    implicit none
    class(*), pointer :: val
    allocate(val, source = 3)
    ! print*, val .as. 0.0_real32
    print*, class_to_int32(val)
    ! print*, val .as. 0_int32
  end program test_polymorphic_class
#+end_src

#+RESULTS[06aefb575a0f3b072e691d7711c5d7cce0c69e5c]:
: 3

*** test
#+name: selection-sort-test
#+begin_src fortran :exports code :noweb no-export
  <<swap-module>>
  <<selection-sort-module>>

  program test_selection_sort
    use, intrinsic :: iso_fortran_env
    use selection_sort_m
    implicit none
    ! integer :: arr(9) = [8, 3, 1, 9, 5, 4, 2, 7, 6]
    integer :: arr(-2:6) = [9, 8, 7, 6, 5, 4, 3, 2, 1]
    integer :: i

    !    do i = -2, 6
    !       arr(i) = i
    !    end do

    print'(*(i0, " "))', (arr(i), i = lbound(arr, dim = 1), ubound(arr, dim = 1))
    call selection_sort(arr)
    print'(*(i0, " "))', (arr(i), i = lbound(arr, dim = 1), ubound(arr, dim = 1))

  end program test_selection_sort
#+end_src

#+RESULTS:
| 9 | 8 | 7 | 6 | 5 | 4 | 3 | 2 | 1 |
| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 |

*** test
#+name: bubble-sort-test
#+begin_src fortran :exports code :noweb yes
  <<swap-module>>
  <<bubble-sort-module>>

  program test_bubble_sort
    use, intrinsic :: iso_fortran_env
    use bubble_sort_m
    implicit none
    ! integer :: arr(9) = [8, 3, 1, 9, 5, 4, 2, 7, 6]
    integer :: arr(-2:6) = [9, 8, 7, 6, 5, 4, 3, 2, 1]
    integer :: i

    !    do i = -2, 6
    !       arr(i) = i
    !    end do

    print'(*(i0, " "))', (arr(i), i = lbound(arr, dim = 1), ubound(arr, dim = 1))
    call bubble_sort(arr)
    print'(*(i0, " "))', (arr(i), i = lbound(arr, dim = 1), ubound(arr, dim = 1))

  end program test_bubble_sort
#+end_src

#+RESULTS: bubble-sort-test
| 9 | 8 | 7 | 6 | 5 | 4 | 3 | 2 | 1 |
| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 |

*** test
#+name: merge-sort-test
#+begin_src fortran :exports code :tangle "test/test_merge_sort.f90"
  program test_merge
    use, intrinsic :: iso_fortran_env
    use merge_sort_m
    implicit none
    integer :: arr(9) = [8, 3, 1, 9, 5, 4, 2, 7, 6]
    integer :: i

    print'(*(i0, " "))', (arr(i), i = 1, size(arr))
    call merge_sort(arr)
    print'(*(i0, " "))', (arr(i), i = 1, size(arr))

  end program test_merge
#+end_src

#+begin_src fortran :exports both :results output :cache yes :noweb yes
  <<merge-sort-module>>
  <<merge-sort-test>>
#+end_src

#+RESULTS[000d13091ef6658230c2841b92c81c674f0f65c8]:
: 8 3 1 9 5 4 2 7 6
: 1 2 3 4 5 6 7 8 9

**** test
#+name: linked_list-test
#+begin_src fortran :exports code :tangle "test/test_linked_list.f90"
  program test_linked_list
    use, intrinsic :: iso_fortran_env
    use linked_list_m
    implicit none
    integer(int32) :: i
    type(linked_list_int32_head) :: lst_i32
    do i = 1, 10
       call lst_i32%add(i)
    end do
    print*, lst_i32%search(3)
    print*, lst_i32%search(-1)
  end program test_linked_list
#+end_src
#+name: test-linked_list
#+begin_src fortran :exports both :results output :noweb no-export :cache yes
<<linked_list-module>>
<<linked_list-test>>
#+end_src

#+RESULTS[94846b1ec8b475a77907acdcedad9a0da205232b]: test-linked_list
: T
: F

